In [21]:
import pandas as pd

In [23]:
dm= pd.read_csv("C:\\Users\\Dell 4\\Documents\\Book1.csv",skiprows=1)

In [25]:
dm

      Isha  21  B  78 Bangalore
0   Vivaan  22  A  92   Chennai
1    Priya  23  C  65  Hydrabad
2  Reyansh  24  B  80        Na

In [27]:
dm= pd.read_csv("C:\\Users\\Dell 4\\Documents\\Book1.csv",names=["Names","Age","Grade","Marks","City"])

In [29]:
dm

     Names Age Grade  Marks       City
0       20   A    85  Delhi     Mumbai
1     Isha  21     B     78  Bangalore
2   Vivaan  22     A     92    Chennai
3    Priya  23     C     65   Hydrabad
4  Reyansh  24     B     80         Na

In [31]:
dm.to_csv("C:\\Users\\Dell 4\\Documents\\Book1.csv" ,index=False)

In [33]:
dm

     Names Age Grade  Marks       City
0       20   A    85  Delhi     Mumbai
1     Isha  21     B     78  Bangalore
2   Vivaan  22     A     92    Chennai
3    Priya  23     C     65   Hydrabad
4  Reyansh  24     B     80         Na

In [37]:
dm=pd.read_csv("C:\\Users\\Dell 4\\Documents\\Book1.csv" , nrows=3)

In [39]:
dm

    Names Age Grade  Marks       City
0      20   A    85  Delhi     Mumbai
1    Isha  21     B     78  Bangalore
2  Vivaan  22     A     92    Chennai

In [53]:
import numpy as np
def convert_City_cell(cell):
       if cell=='NaN':
            return 'Hello'
            return cell
def cobert_Grade_cell(cell):
        if cell=='NaN':
            return 'zero'
            return cell
            dm=pd.read_csv('C:\\Users\\Dell 4\\Documents\\Book1.csv',names=["Names","Age","Grade","Marks","City"], converters={'City':convert_City_cell,'Grade':convert_Grade_cell})

In [56]:
dm

    Names Age Grade  Marks       City
0      20   A    85  Delhi     Mumbai
1    Isha  21     B     78  Bangalore
2  Vivaan  22     A     92    Chennai

In [60]:
dm.to_excel('Book1.xlsx',sheet_name='sheet1')

In [62]:
dm

    Names Age Grade  Marks       City
0      20   A    85  Delhi     Mumbai
1    Isha  21     B     78  Bangalore
2  Vivaan  22     A     92    Chennai